{"site":{"posts":[{"draft":false,"categories":[],"layout":"post","date":"2012-07-09 19:00:00 +0700","title":"Berlin","description":"This 10 day visit to Berlin was my first trip to a European city and I was not at all disappointed.","tags":["travel"],"image":"/images/berlin.jpg","slug":"berlin","ext":".markdown","excerpt":"<p>I’ve heard Berlin described as a “Start-up City”. Since the wall came down in 1989 (just over 20 years ago) the city and the people living there have had to start almost from scratch trying to build a city and a culture of their own. The city seems almost empty in places which gives you a great sense of freedom, especially if you get out of the house before 9 am when everyone is still indoors.</p>\n","content":"<p>I’ve heard Berlin described as a “Start-up City”. Since the wall came down in 1989 (just over 20 years ago) the city and the people living there have had to start almost from scratch trying to build a city and a culture of their own. The city seems almost empty in places which gives you a great sense of freedom, especially if you get out of the house before 9 am when everyone is still indoors.</p>\n\n<p>I was visiting Berlin during summer and from all accounts I got pretty lucky with the weather. Most days were sunny and warm, even if there was a slight shower in the morning or storm at night. This meant that people were lured to the many parks and markets around the city to enjoy the summer vibe. Most of the parks are more than just green grass and will also have table tennis, basketball, play equipment, bocce areas or any number of other facilities setup for the general public to use and enjoy.</p>\n\n<p><img src=\"/images/berlin-park.jpeg\" alt=\"Park life\" width=\"612\" height=\"612\" /></p>\n\n<p>Mauer park on a sunny Sunday afternoon seems to be the place to hang out, especially with a few friends and a few drinks from the markets. There is a small amphitheatre in the park and I was told that on a good day there can be 100s of people there participating in free outdoor public Karaoke. Unfortunately (or perhaps fortunately) the Karaoke wasn’t on, but instead we were treated to an interesting display of flexibility and comedy by a performer and her DJ.</p>\n\n<p>Getting around Berlin by bike is super easy. There are a lot of bicycle paths, wide roads, and almost no hills to speak of. In general, bicycles have right of way on the roads and drivers seem to be always on the look out for bicycles when turning or overtaking. As I had my bike, I didn’t need to catch a train, but from what I hear it’s pretty straightforward as well.</p>\n\n<p>While in Berlin I had arranged to do a few days of contract work, so I was in need of somewhere to work from. From what I was told, most cafés are welcoming to people buying a coffee, using the WIFI, and sitting down for a day’s work. Luckily for me, Tim already had an office space that he worked out of that I was able to use which made things much easier. There was one day where I just worked from the lounge at my accommodation which was quite comfortable as well.</p>\n\n<p>My time in Berlin ended up being way too short to get a really good feel for the place - especially seeing as I had so much organising and work to do during my week there. I’ll definitely be back again and next time I’ll hang around for a while.</p>\n","url":"/blog/berlin","relative_path":"_posts/2012-07-09-berlin.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2012-07-09 19:00:00 +0700","title":"Starting the European Tour","description":"It was finally time to start my big ride through Europe and I was happy to have a friend along to join me.","tags":["travel"],"image":"/images/bike_path_b.jpg","slug":"starting-the-european-tour","ext":".markdown","excerpt":"<p>It always helps to be a little unprepared while on a tour, that way you can roll with the punches and take advantage of situations when they arise. Tim and I had planned a pretty uneventful beginning to our trip. We would fly to Geneva, unpack our bikes, ride to the campsite, and then leave the next day for Annecy. Well, we never made it to Annecy, even though people keep telling me how great it is.</p>\n","content":"<p>It always helps to be a little unprepared while on a tour, that way you can roll with the punches and take advantage of situations when they arise. Tim and I had planned a pretty uneventful beginning to our trip. We would fly to Geneva, unpack our bikes, ride to the campsite, and then leave the next day for Annecy. Well, we never made it to Annecy, even though people keep telling me how great it is.</p>\n\n<p>We landed in Geneva around 2pm with our bikes and luggage. Our first step was to get the bikes out of their boxes and get everything ready to go. We found a quiet corner near the airport car park and built our bikes without any trouble at all. After throwing out our rubbish and neatly folding our boxes next to the bin, we quietly rolled away.</p>\n\n<p><img src=\"/images/putting_the_bikes_together_b.jpg\" alt=\"Putting our bikes together at the airport\" width=\"1000\" height=\"666\" /></p>\n\n<p>Not long after, we arrived at our lakeside campsite, pitched our tents, and had dinner with another tourer that we had meet at the airport. So far, everything was going just as planned.</p>\n\n<p><img src=\"/images/geneva_b.jpg\" alt=\"Nice easy ride to Geneva\" width=\"1000\" height=\"750\" /></p>\n\n<p>As we walked into the TV room that night, I happened to glance around and catch sight of someone familiar, but I was a bit unsure if it was who I thought it was. Being the high tech type of guy I am, I checked Facebook and indeed it showed his status as being in Geneva. I got up, walked over and introduced myself and Tim to Darren Alff.</p>\n\n<blockquote>\n  <p>Of all the people to randomly run into on day 1 of my first big bicycle tour, Darren Alff may well be the perfect person.</p>\n</blockquote>\n\n<p>Darren has been running bicycletouringpro.com for years and I’ve spent a lot of time on his site picking up touring tips, reading his books and getting inspiration for places to travel. We all had a bit of a chat that night about our upcoming travel and agreed to catch up again in the morning over breakfast and coffee.</p>\n\n<p>In the morning while I was packing up, Darren came over and took pictures of our gear and we started chatting about travel, business, touring gear, and other such topics. After breakfast we took the opportunity for a couple of photos by the lake, before saying our goodbyes, as Tim and I hit the road.</p>\n\n<p>It still blows my mind that I just happened to run into Darren on day number 1 the tour.</p>\n\n<p><img src=\"/images/me_tim_and_darren_b.jpg\" alt=\"Tim, Darren and me down by Lake Geneva\" width=\"1000\" height=\"666\" /></p>\n\n<p>We had planned to leave Geneva at about 9 that morning to give us plenty of time to get to Annecy. Our conversations with Darren ended up pushing our start time closer to 12:30, but we figured we should be able to make it anyway.</p>\n\n<p>After the late start, we were full of energy as we rolled through with Swiss country side and into France. The problem was that because it was Monday, almost everywhere in France was closed and we had run out of time to pick up all our food supplies in Geneva earlier that day. On top of that, it was a hot day so we were going through our water pretty fast.</p>\n\n<p>Rather than risk an uncomfortable 60 km ride to Annecy, we opted for the easier ride to Seyssel which was only 15 km away. It turned out to be a great decision, as it wasn’t long before we were at our campsite sipping wine and eating fresh food by the river.</p>\n\n<p>Even though we missed out on seeing Annecy this time around, our decision to play it safe on our first day of riding, plus spending a bit more time with Darren, turned out to be the perfect way to kick off our tour.</p>\n\n<p><img src=\"/images/bike_path_b-1.jpg\" alt=\"One of the excellent bike paths in the first day\" width=\"1000\" height=\"666\" /></p>\n\n<p><img src=\"/images/into_the_alps_b.jpg\" alt=\"Beautiful scenery as the alps loom ahead\" width=\"1000\" height=\"747\" /></p>\n","url":"/blog/starting-the-european-tour","relative_path":"_posts/2012-07-09-starting-the-european-tour.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2012-07-10 19:00:00 +0700","title":"The Chambery miscalculation","description":"On our trip from Geneva to Lyon, Tim and I gave ourselves a couple of days off here and there so we could really enjoy the French Alps.","tags":["travel"],"image":"/images/lac_du_bourget_b.jpg","slug":"the-chambery-miscalculation","ext":".markdown","excerpt":"<p>Early into the tour and our plans were already off track, but it turned out we were on a pretty well worn bicycle route that would take us to Chambery. And as an added bonus we would be getting a day off in Chambery because our new route was a bit shorter. Well that’s what we thought at the time anyway.</p>\n","content":"<p>Early into the tour and our plans were already off track, but it turned out we were on a pretty well worn bicycle route that would take us to Chambery. And as an added bonus we would be getting a day off in Chambery because our new route was a bit shorter. Well that’s what we thought at the time anyway.</p>\n\n<p><img src=\"/images/riding_to_the_campsite_b.jpg\" alt=\"Riding to the campsite in Chambery\" width=\"1000\" height=\"666\" /></p>\n\n<p>We arrived in Chambery, found a campsite, went for a swim in the lake and had a great dinner at a local restaurant. Since we had the next day off, we indulged in a few extra drinks and even stopped by the open air cinema that was playing just down the road. A great day had by all.</p>\n\n<p><img src=\"/images/final_meal_of_the_day_b.jpg\" alt=\"Enjoying a fantastic dinner by the lake\" width=\"1000\" height=\"666\" /></p>\n\n<p>The next day we took a leisurely ride around the lake, had a long lunch and strolled back into camp sometime in the afternoon. Since we are obviously the over prepared types, we thought we would see what our ride was like the next day. We soon realised that we should have been riding that day instead of taking the day off. We’re still unsure how we got it into our heads that we had a day up our sleeves, but all of a sudden it looked like we might miss out on seeing the Tour de France.</p>\n\n<blockquote>\n  <p>all of a sudden it looked like we might miss out on seeing the Tour de France.</p>\n</blockquote>\n\n<p>We started discussing various options such as: riding during the night, getting up super early the next day, or missing the tour. With about 80 kilometres of riding to get us where we needed to be we were running out of sensible ideas. Then we remembered that good old fashioned transport option, the train.</p>\n\n<p><img src=\"/images/riding_around_the_lake_b.jpg\" alt=\"Riding around the lake on our day off\" width=\"1000\" height=\"853\" /></p>\n\n<p>Luckily for us there is a train every few hours that goes from Chambery to Saint Avre - where our booked campsite was located. So after quickly packing up and getting to the train, we arrived in Saint Avre and found the campsite without trouble.</p>\n\n<p><img src=\"/images/arriving_at_saint_avre_b.jpg\" alt=\"Arriving at Saint Arve train station\" width=\"1000\" height=\"666\" /></p>\n\n<p>So all’s well that ends well. It does mean we missed out on the ride from Chambery to Saint Avre, but the day’s rest probably came in handy because we had a big climb ahead of us the next day to get to the finish line of the Tour de France.</p>\n","url":"/blog/the-chambery-miscalculation","relative_path":"_posts/2012-07-10-the-chambery-miscalculation.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2012-07-12 19:00:00 +0700","title":"Tour de France","description":"Even though I enjoy riding I’ve never been a big fan of watching the Tour de France on television.","tags":["travel"],"image":"/images/tim_climbing_the_mountain_b.jpg","slug":"tour-de-france","ext":".markdown","excerpt":"<p>Tim had watched the Tour de France with some friends the year before and said it was a great experience so we decided to do the same this year. Since we were in the middle of our bike tour it only seemed right that we should ride part of the tour to get a feel for the race. We decided to ride the final mountain of stage 14 of the tour and watch the riders cross the finish line.</p>\n","content":"<p>Tim had watched the Tour de France with some friends the year before and said it was a great experience so we decided to do the same this year. Since we were in the middle of our bike tour it only seemed right that we should ride part of the tour to get a feel for the race. We decided to ride the final mountain of stage 14 of the tour and watch the riders cross the finish line.</p>\n\n<p><img src=\"/images/view_on_the_way_up_b.jpg\" alt=\"We made many stops to take in the view and take a much needed break.\" width=\"1000\" height=\"750\" /></p>\n\n<p>We left our bags at the campsite and we rode 13 km to Saint Jean de Maurienne, where we would start our long uphill ride which would takes us just over 2 hours and see us gain 1400 meters in elevation on a very hot day.</p>\n\n<p><img src=\"/images/tim_climbing_the_mountain_b-1.jpg\" alt=\"We had about 1 km to go at this point and we were looking forward to finish.\" width=\"1000\" height=\"750\" /></p>\n\n<p>As neither of us are trained riders, we took our time with the difficult climb and often stopped to take photos when the going got particularly tough. Riding that one mountain climb of the Tour de France really gave me a great appreciation for the athletes that ride the race every year.</p>\n\n<p><img src=\"/images/finish_line_festival_b.jpg\" alt=\"Plenty of food and drink at the finish line to celebrate with.\" width=\"1000\" height=\"750\" /></p>\n\n<p>We spent several hours eating, drinking and chatting to other riders near the finish line. The riders eventually came flying by to sounds of a roaring crowd - with Tim and I included. Once it was all over, there was only one thing left to do: ride back down.</p>\n\n<p><img src=\"/images/classic_rider_b.jpg\" alt=\"This guy once complete the tour on that bike, very impressive.\" width=\"1000\" height=\"750\" /></p>\n\n<p><img src=\"/images/riders_going_past_b.jpg\" alt=\"The riders fly by and it's all over pretty quickly.\" width=\"1000\" height=\"750\" /></p>\n\n<p>Riding down the twisting roads - through traffic and other riders - was fast, and at times a bit tricky. Near the bottom of the mountain there was a bit of a traffic jam to weave through but once we were back on the road, the excitement of the day made the ride back to camp quite enjoyable.</p>\n\n<p><img src=\"/images/the_alps_b.jpg\" alt=\"Around every corner was another spectacular view \" width=\"1000\" height=\"750\" /></p>\n\n<p>The next day we made our way to the start line to watch the beginning of the next stage. Due to road closures we jumped on a train to Saint Jean de Maurienne and then locked up our bikes, so we could take in the atmosphere of the tour one last time.</p>\n\n<p>We took a stroll up the main road where all the team buses were lined up and watched as riders were interviewed, signed autographs, and went for a warm up ride, before we made our way to the start line. Luckily we found a pretty good spot to watch from - just as the count down began to the start of the stage.</p>\n\n<p>After the start gun fired, there was a bit of drama with an early accident, as one rider hit a bump in the road and fell off. Once all the riders were gone, the French TV reporter managed a very animated discussion about the bump for a good few minutes.</p>\n\n<p>So if you are thinking about watching the tour yourself one day, I can highly recommend choosing a finish line festival and making sure you get there early to really enjoy the event. If you really want the full experience, grab your bike and tackle a mountain.</p>\n","url":"/blog/tour-de-france","relative_path":"_posts/2012-07-12-tour-de-france.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2012-08-18 19:00:00 +0700","title":"Stolen Bicycle","description":"I planned to stay in Paris for 2 weeks. While there I would catch up with a friend, see the sights of Paris, do some work, and then set off for Amsterdam. I never planned on getting my bike stolen. ","tags":["travel"],"image":"/images/brand_new_bike_b.jpg","slug":"stolen-bicycle","ext":".markdown","excerpt":"<p>I awoke early on a Saturday morning and headed downstairs to grab my morning coffee and croissant from the local café. I looked over to where my bike was locked up only to discover that it wasn’t.</p>\n","content":"<p>I awoke early on a Saturday morning and headed downstairs to grab my morning coffee and croissant from the local café. I looked over to where my bike was locked up only to discover that it wasn’t.</p>\n\n<p>To be sure I wasn’t losing my mind, I took a quick walk around the block to confirm that I hadn’t locked up somewhere else the day before. I was almost certain that I hadn’t, so as I walked I mentally put together a list of things to do next.</p>\n\n<ul>\n  <li>Find where the closest police station is</li>\n  <li>Take photos of where the bike was stolen from</li>\n  <li>File a police report (I didn’t hold much hope of getting it back)</li>\n  <li>Let friends and family back home know what happened</li>\n  <li>Get back to the apartment and look for bike shops</li>\n  <li>Visit as many shops as possible to find a new bike</li>\n  <li>Lodge an insurance claim through my travel insurance</li>\n</ul>\n\n<p>It’s funny, I don’t remember ever being really upset when it happened; I was more concerned with what had to happen next. I had spent a long time and a decent sum of money getting that bike put together just the way I wanted. Although I had owned the bike for about 2 years, the only real touring I had done with it was the 2 previous weeks travelling from Geneva to Paris.</p>\n\n<p><img src=\"/images/looking_good_b.jpg\" alt=\"We looked so happy together\" width=\"612\" height=\"666\" /></p>\n\n<p>Once items 1 to 5 on my list were done, I took a trip (on foot) to a few of the local bike shops. A couple of them were closed as this time of year many businesses go on holidays (just my luck) and the other few I went to didn’t have any touring specific bikes on offer. Over the next week I went from shop to shop and had a real hard time finding anything that looked like it would do the job.</p>\n\n<p>I then found a small shop that specialises in classic bikes and as I’m a sucker for an old fashioned steel frame bike I pick one from the show room floor that was really nice. I took it for a ride and it was just the right size and rode really well, so I decided to buy it. It needed a few additions like front and rear panniers as well as stronger wheels, but after a couple more days it was all setup and ready to go.</p>\n\n<p><img src=\"/images/the_wrong_bike_2_b.jpg\" alt=\"She had everything going for her\" width=\"612\" height=\"668\" /></p>\n\n<p>I set off from Paris with the bike fully loaded. The bike felt much less sturdy than my last touring bike, but as this was closer to a racing frame, that was to be expected. I had trouble with the pedals as well. Before I bought the bike, I asked the guy if I could change the pedals so I could clip my shoes in and he said it wouldn’t be a problem. Well it was a problem - the bike had non-standard thread sizes, so I couldn’t swap them out.</p>\n\n<p>Due to the frame size I also had to put thinner tyres on the bike. I didn’t think that would be a problem, as most of my touring was on the road thus far. After three days riding towards Amsterdam and a fair bit of rough riding, I already had three flat tyres - which is really quite ridiculous. Not having clipped-in shoes was getting annoying as well.</p>\n\n<p>As the frustration grew, I started to get the feeling I had made a big mistake in choosing this bike for my next 4 months of touring. If you don’t have confidence in your bike on a tour, it makes it very difficult to enjoy. Before making any rash decisions, I stopped for a night in a hotel in the town of Meaux to think about my options.</p>\n\n<blockquote>\n  <p>If you don’t have confidence in your bike on a tour, it makes it very difficult to enjoy</p>\n</blockquote>\n\n<p>The next morning I was a bit calmer and I had made the decision to continue with the bike, but just take it a bit easier. Before setting off I went into town to grab some food, leaving my bags at the hotel. My bike wasn’t even loaded up with weight, but as I rolled my bike up a gutter, I got another flat tyre! That was the last straw. I decided to head back to Paris to get another bike.</p>\n\n<p>The next day I got a train to Paris, got a campsite just outside the city, and called the place where I got the bike. The guy I bought the bike from said he wouldn’t refund the bike as he sold it second hand and was really unhelpful, even though he must have known I was frustrated at this point. Maybe I should have pushed him more to take the bike back, but I just wanted to move on at this point.</p>\n\n<p>On my way back to my campsite I rode past a shop called Rando Cycles. It had a window full of touring bicycles, all of which were absolutely perfect for my ride. I wish I had found this shop earlier. The shop was closed for holidays (more bad luck) and wouldn’t be open for another week and a half. To make the most of a bad situation I checked into the campsite for another week, and spent the time riding around Paris, visiting museums, and doing some work.</p>\n\n<p><img src=\"/images/lourve_statue_b.jpg\" alt=\"At least I got to visit the Louvre, which I missed last visit \" width=\"612\" height=\"668\" /></p>\n\n<p>The day Rando Cycles came back from holidays I was there early in the morning and explained what I needed. The guy there was super helpful and knew exactly what I was after. He pointed me straight towards a brand new Surly Long Haul Trucker. I had seen the Long Haul Trucker before and it’s definitely a sturdy touring bike. It has a steel frame, fat tyres, comfortable handlebars and I was even able to get a dyno hub for a bit of extra money.</p>\n\n<p>As you may have guessed, nothing about this story comes easy for me. I had to wait another week until it would be ready. So another week in Paris it was. This time I checked into a small cabin at the campsite, as I was a bit sick of being in my 1 man tent for so long. More sightseeing, more work, and more time in the city that stole my bike.</p>\n\n<p>I finally got the bike, loaded it up and took it for a test ride. It was perfect. It felt really solid, I could clip my shoes in, I had a dyno hub to generate power and on top of all that it looks pretty slick as well. The guys from Rando Cycles even agreed to sell my current bike and take a cut of the sale price, so I don’t have to worry about selling it.</p>\n\n<p><img src=\"/images/first_day_loaded_up_b.jpg\" alt=\"Loaded up and ready for a test ride\" width=\"612\" height=\"750\" /></p>\n\n<p>So in summary, I had my custom bike stolen, I bought the wrong bike (which still hasn’t sold), I bought the right bike (which has been great ever since) and I’ve enjoyed my tour to this day. The lessons learnt are the following:</p>\n\n<ul>\n  <li>When renting a place while on tour, always have a place to lock up your bike off the street, especially in cities</li>\n  <li>Having a good bike that’s built for touring makes all the difference</li>\n  <li>Don’t rush into a big buy decision while on the road</li>\n  <li>If you are in Paris and need a touring bike, go to Rando Cycles</li>\n</ul>\n\n<p><img src=\"/images/live_to_ride_another_day_b.jpg\" alt=\"Live to ride another day \" width=\"612\" height=\"668\" /></p>\n","url":"/blog/stolen-bicycle","relative_path":"_posts/2012-08-18-stolen-bicycle.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2012-09-10 19:00:00 +0700","title":"Paris","description":"Paris is such an iconic city that it’s hard to know where to start. I didn’t really have a plan when I arrived, but I had a list of things to see and do including the Eiffel Tower, Louvre Museum, Arc de Triomphe and a few others. ","tags":["travel"],"image":"/images/paris_b.jpg","slug":"paris","ext":".markdown","excerpt":"<p>I spent around 4 weeks in Paris wandering around viewing all the major sights, as well as discovering a few smaller areas for myself. It’s a great city to get around in, as there are pretty good bike paths and the public transport is easy enough. Instead of a long winded post, I thought I would let the pictures do most of the talking.</p>\n","content":"<p>I spent around 4 weeks in Paris wandering around viewing all the major sights, as well as discovering a few smaller areas for myself. It’s a great city to get around in, as there are pretty good bike paths and the public transport is easy enough. Instead of a long winded post, I thought I would let the pictures do most of the talking.</p>\n\n<p><img src=\"/images/eiffel_tower_b.jpg\" alt=\"Enjoying the park on a beautiful sunny day\" width=\"960\" height=\"1280\" /></p>\n\n<p><img src=\"/images/iconic_paris_b.jpg\" alt=\"I really like this shot, seems to sum up Paris quite nicely.\" width=\"855\" height=\"1280\" /></p>\n\n<p>While in Paris, I rented a nice inner city apartment for a couple of weeks which made my stay much more enjoyable. I found the place through the website AirBnB</p>\n\n<p><img src=\"/images/roof_top_view_b.jpg\" alt=\"View from the Paris apartment where I was staying\" width=\"1280\" height=\"855\" /></p>\n\n<p>View from the Paris apartment where I was staying View from the Paris apartment where I was staying</p>\n\n<p>I spent a full day walking around the Louvre Museum. Before going in, all I really knew about the place was that it held the Mona Lisa. I was really surprised by how big the place was and the quality of the artwork that was on display. A must visit if you are in town.</p>\n\n<p><img src=\"/images/lourve_painting_b.jpg\" alt=\"I love these epic paintings that revealed the story behind a moment in time.\" width=\"1280\" height=\"855\" /></p>\n\n<p><img src=\"/images/lourve_statue_b-1.jpg\" alt=\"Statue\" width=\"1280\" height=\"855\" /></p>\n\n<p>If you are going to visit Paris, my one piece of advise is to leave time to just walk or ride around the city. There is just so much to discover and walking around a corner to discover an amazing park or museum is the perfect way to experience the city.</p>\n\n<p>Oh, and don’t leave your bike locked up on the street overnight! While in Paris my bicycle was stolen. :(</p>\n\n<p><img src=\"/images/seine_river_b.jpg\" alt=\"Seine River \" width=\"1280\" height=\"855\" /></p>\n","url":"/blog/paris","relative_path":"_posts/2012-09-10-paris.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2012-09-22 19:00:00 +0700","title":"How I started Bicycle Touring","description":"I guess I started my bicycle touring adventures a bit later than most other travelers seem to, I was almost 32 when I went on my first big tour which was a few weeks in New Zealand. Grab a drink and let me tell you a brief story about how it all began ","tags":["travel"],"image":"/images/byron_bay_b.jpg","slug":"how-i-started-bicycle-touring","ext":".markdown","excerpt":"<p>In early 2010 I was living in the beach side town of Byron Bay on the east coast of Australia. I had been there a few years working for a local company and as it was mostly a tourist town I would always hear the stories from other travellers of the places they had visited and enjoyed on their journey.</p>\n","content":"<p>In early 2010 I was living in the beach side town of Byron Bay on the east coast of Australia. I had been there a few years working for a local company and as it was mostly a tourist town I would always hear the stories from other travellers of the places they had visited and enjoyed on their journey.</p>\n\n<p>One day I was at a friend’s place watching TV and I caught an episode or two of The Long Way Around which featured Ewan McGregor and Charley Boorman going around the world on their motorbikes. They left from Scotland and were going through Russian and finishing on the west coast of the USA. Not long after, that I saw a box set of the series on sale at a local video store and bought the complete set which contained that series along with The Long Way Down and The Dakar series as well.</p>\n\n<p><img src=\"/images/long_way_around_b.jpg\" alt=\"The Long Way Around \" width=\"1000\" height=\"667\" /></p>\n\n<p>I became so hooked on the show I watched the whole three seasons, which must have been over 24 hours of television, in the space of just a few weeks. I loved the adventure, challenge and independence of the whole trip. It just seemed to me like a great way to really get out there and experience what the world has to offer.</p>\n\n<p>I’ve never really ridden a motorbike and at the time the only reason to drive the car was the occasional trip out of town or maybe to work on a cold and rainy day. I did have a bicycle though, and I started to wonder if people took similar long trips by bicycle instead of a motorbike. I jumped on the internet and searched for things like “long distance bike trip”, “extended bike ride” and “travelling the world on bicycle”. Eventually I somehow came across the phrase “bicycle touring” and suddenly I found a world of people who were already out there and doing just what I had envisioned.</p>\n\n<p>To test the waters I started taking longer rides on the weekend, never overnight though, and I began to really enjoy those long rides through the countryside. Eventually I moved back to my home city of Sydney and when it came time to get a new bike I made sure it suitable for long distance touring. I would do the occasional ride on a weekend for a few hours and once or twice did some overnight trips down the coast, I was starting to get the feeling I should plan a longer trip.</p>\n\n<p>I had been thinking about travelling to Europe for a while at this stage, even before the whole touring idea popped up, and one day the idea of touring around Europe came to mind. I immediately loved the idea, I could be just like Ewan and Charley, travelling through the unknown under my own power and explore places that I had never been before.</p>\n\n<p>Before shipping off to undertake a multiple month trip around Europe I decided to start a bit smaller first so when I was going to New Zealand in early 2012 for a conference I decided to add on a few weeks of touring as well. I had such a fantastic time in my 3 weeks around the south island of New Zealand that I couldn’t wait to start my European trip in June of that same year.</p>\n\n<p><img src=\"/images/lake_matherson_b.jpg\" alt=\"Lake Matheson in New Zealand.\" width=\"1000\" height=\"750\" /></p>\n\n<p><img src=\"/images/new_zealand_riding_b.jpg\" alt=\"Epic New Zealand scenery.\" width=\"1000\" height=\"750\" /></p>\n\n<p>So there you have it, from inspiration to planning and finally hitting the road. I’m still fair from an expert bicycle tourer but I’m slowly learning as I go and having an excellent time in the process. If you have your own story on how you got started touring I’d love to hear it.</p>\n\n<p><img src=\"/images/european_tour_b.jpg\" alt=\"Living the dream in Europe\" width=\"1000\" height=\"750\" /></p>\n","url":"/blog/how-i-started-bicycle-touring","relative_path":"_posts/2012-09-22-how-i-started-bicycle-touring.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2012-12-02 19:00:00 +0700","title":"Paris to Amsterdam","description":"During 2 weeks in September I set off from Paris and I headed for Amsterdam. This ride took me through French wine country, along winding rivers, across Belgium and finished with a goat.","tags":["travel"],"image":"/images/canal_paths_b.jpg","slug":"paris-to-amsterdam","ext":".markdown","excerpt":"<p>It was mid September in France and I was looking forward to making the most of the remaining warm weather. I spent much longer than expected in Paris due to having my bicycle stolen so I was very keen to hit the road. The plan was to take a couple of weeks and ride to Amsterdam where I would stay with a friend for a few days and take in the city.</p>\n","content":"<p>It was mid September in France and I was looking forward to making the most of the remaining warm weather. I spent much longer than expected in Paris due to having my bicycle stolen so I was very keen to hit the road. The plan was to take a couple of weeks and ride to Amsterdam where I would stay with a friend for a few days and take in the city.</p>\n\n<p>Being back on the bike and leaving Paris behind was a fantastic feeling. The troubles of the last few weeks were behind me, the weather was perfect and I loved being on the road again. It wasn’t long before the paved paths quickly gave way to dirt tracks that followed winding canals through the countryside. Once again I was back in the wide world with nothing to do but ride.</p>\n\n<p>As chance would have it I was riding through wine country just as the vineyard harvest season was starting. Row after row of vines were bulging with grapes ready for the picking, nothing beats fresh food while on the move. There were people camping around the vineyards and a few of the towns had festivals in full swing. I spent a couple of afternoons wandering around different festivals, trying food and soaking in the atmosphere. Everyone seemed in high spirits and out to have a good time.</p>\n\n<p><img src=\"/images/harvest_time_b.jpg\" alt=\"Ripe for the picking\" width=\"1000\" height=\"668\" /></p>\n\n<p>The riding was a real mixed bag for the first week, one moment I would be cruising along a beautiful path and then it would quickly become a mud bath through a forest. Some of the days were pretty difficult but I was always smiling at the end of the day. After the first week everything changed for the better, it was a perfect bike path following rivers that wound their way through the mountains towards Belgium. My last stop in France was near the town of Givet where I met Frank and David.</p>\n\n<p><img src=\"/images/david_b.jpg\" alt=\"David, in the background you can see the old military ground where he trained years ago\" width=\"1000\" height=\"750\" /></p>\n\n<p><img src=\"/images/frank_b.jpg\" alt=\"Frank setting off for another day on the water on his way to Spain\" width=\"1000\" height=\"668\" /></p>\n\n<p>David was from France and travelling on his motorbike to Belgium for a bike festival. It sounded like it was going to be quite the party when he arrived. The campsite we were staying at was across the river from an old military training ground that was now closed. It turned out that David had trained there some 25 years ago. He told us a few stories of climbing nearby mountains with grappling hooks as part of the training, tough guy.</p>\n\n<p>Frank, a Norwegian, was on an epic journey of his own. He was kayaking all the way from Norway to Spain and hoping to finish in Santiago de Compostela. Parts of the journey would be along the coast but a lot of it was following the canals. It sounded like a rough way to travel but he seemed to be enjoying himself. It was even more impressive seeing as he was retired and in his 60’s.</p>\n\n<p>The next day I left France and rode into Belgium. In the morning I saw a guy with his loaded bicycle having something to eat so I stopped to have a chat. It turns out he was on his last day of a 2 month ride from Holland to France and back. We spent the day chatting as we rode, his bike was very beat up so we walked in places where he couldn’t ride. We said our goodbyes in Dinant not long after lunch.</p>\n\n<p><img src=\"/images/dinant_b.jpg\" alt=\"Dinant, Belgium. Home of the saxophone.\" width=\"1000\" height=\"668\" /></p>\n\n<p>Riding through Belgium was wonderful, it was nice and flat, great bike paths and quiet countryside scenery. I stopping in Hoegaarden for a couple of nights and visited the brewery there and ate way too much good food. It only took a couple of days riding before I was through Belgium and into The Netherlands.</p>\n\n<p><img src=\"/images/windmill_b.jpg\" alt=\"I was pleased to see a good number of windmills through Belgium and Holland.\" width=\"1000\" height=\"668\" /></p>\n\n<p>At one point I was riding through a small town and a guy on a scooter pulls up beside me to ask a few questions about my trip. After a brief chat he invites me to his place for a coffee, I was only too happy to accept. A quick ride later we arrive at his house where I met his, surprised looking, wife and two children. We had a good chat about travel and bikes and before leaving Patrick suggested a scenic route to take to Amsterdam.</p>\n\n<p><img src=\"/images/reflections_b.jpg\" alt=\"Sometimes it's hard to keep your eyes on the path ahead, good thing I wasn't in a hurry.\" width=\"1000\" height=\"668\" /></p>\n\n<p><img src=\"/images/raf_b.jpg\" alt=\"I rode with Raf for several hours after entering Belgium.\" width=\"1000\" height=\"668\" /></p>\n\n<p>Following Patrick’s instructions I found a great little campsite by the canal which had a few farm animals wandering around. As was the case a few times along this trip I was the only person at the campsite while I was there. The next morning I arrived in Amsterdam and after 15 days of riding through France, Belgium and The Netherlands I was greeted by a goat on a log.</p>\n\n<p>I think I’m going to like this place…</p>\n\n<p><img src=\"/images/goat_b.jpg\" alt=\"It's a goat... on a log \" width=\"1000\" height=\"668\" /></p>\n","url":"/blog/paris-to-amsterdam","relative_path":"_posts/2012-12-02-paris-to-amsterdam.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2012-12-16 19:00:00 +0700","title":"Bordeaux, Bilbao and Burgos","description":"It was getting later in the year so I decided to head south to warmers weather. To kick of the next section of my trip I traveled to Bordeaux and from there I would be riding along the coast into Spain. ","tags":["travel"],"image":"/images/fishing_town_b.jpg","slug":"bordeaux-bilbao-and-burgos","ext":".markdown","excerpt":"<p>It was early October and I was in Amsterdam spending time exploring the city by myself and with friends. My original plan was to arrive here much earlier and then get the ferry across to the UK. I would then spend a month riding from Scotland to London. This late in the year most campsites in the UK seemed to be closed and the prospect of riding through the cold and wet went against my sun loving Australian nature. So instead I decided to head to Spain!</p>\n","content":"<p>It was early October and I was in Amsterdam spending time exploring the city by myself and with friends. My original plan was to arrive here much earlier and then get the ferry across to the UK. I would then spend a month riding from Scotland to London. This late in the year most campsites in the UK seemed to be closed and the prospect of riding through the cold and wet went against my sun loving Australian nature. So instead I decided to head to Spain!</p>\n\n<p>I looked at a map and for no particular reason I chose to start my next ride in Bordeaux. It seemed like following the coast into Spain would be a nice way to travel. I could have flown to Bordeaux but packing up the bike and all my gear would have been a bit of a hassle so I decided to get the train instead. Unfortunately to get a bike on the high speed trains you also need to pack them up plus they have luggage limits. So I mapped out a way to get from Amsterdam to Bordeaux only using smaller regional trains that would take me through Stuttgart and Paris.</p>\n\n<blockquote>\n  <p>It took approximately ten trains over three days but I eventually arrived in Bordeaux.</p>\n</blockquote>\n\n<h2 id=\"bordeaux-to-spain\">Bordeaux to Spain</h2>\n\n<p>I spent a couple of days in Bordeaux and then, on the 10th of October, I set off west to the Atlantic ocean. The bike paths out of Bordeaux and along the coast were fantastic. They seemed fairly new and away from the big roads and for the most part going flat through forests and small towns. At the time the routes were marked as minor bike paths so I wasn’t expecting this at all. Looking at my cycling maps now I can see they have been changed to main bike paths which seems much more appropriate.</p>\n\n<p><img src=\"/images/bordeaux_b.jpg\" alt=\"Bordeaux, Monument aux Girondins, fountain.\" width=\"1000\" height=\"750\" /></p>\n\n<p>Many campsites close during this time of year so that meant a few nights camping in the wild. For my first night I found a great little spot next to a beautiful lake and cooked up some dinner. As the sun started to set I jumped inside my tent, ready to call it a night. Then I heard the first gunshot. Soon after that I heard someone wading through the water nearby. I had seen other hunters a couple of weeks previously so I knew they could be around. Unfortunately it seems I had pitched my tent right near a hunting area. There were a few more shots here and there but It wasn’t long before the sun was down and the noises stopped. Ah, the great outdoors.</p>\n\n<p><img src=\"/images/lakeside_camping_b.jpg\" alt=\"The lakeside campsite that ended up being a bit too close to the hunting area.\" width=\"1000\" height=\"750\" /></p>\n\n<p>A couple more days riding and I was starting to get close to the Spanish border. The riding had been peaceful and I had a lot of time to myself as not many travellers were around this time of the year. Then the day before I reached the border I met another bicycle tourer, this was Bingen from Bilbao. Bingen was riding home from Nantes on his first big ride. We spent the day riding together and even stopped for lunch at an Australian café where he had his first burger with beetroot on it. A true Aussie experience.</p>\n\n<p><img src=\"/images/bingen_b.jpg\" alt=\"Saying goodbye to Bingen.\" width=\"1000\" height=\"668\" /></p>\n\n<p>We went our separate ways after a quick stop in Saint Jean de Luz for a drink and made plans to meet up again when I arrived in Bilbao. The next day I had a short ride and I crossed the border into Spain then it promptly started to rain for the rest of the day. I was in the city of Irun so I booked a small room for a couple of nights so I could let the weather pass and plan my ride to Bilbao.</p>\n\n<p><img src=\"/images/mimizan_beach_b.jpg\" alt=\"Quick stop at Mimizan beach, good thing the weather was fantastic.\" width=\"1000\" height=\"668\" /></p>\n\n<h2 id=\"irun-to-burgos\">Irun to Burgos</h2>\n\n<p>It took four days of riding to get from Irun to Bilbao and the scenery was spectacular. The roads hugged the coast line and every now and then you would round a corner to see a secluded beach, small fishing town, coastal cliffs or green forest. There was definitely a fair share of hills along the way as well but after riding flat roads for so long I was enjoying the challenge.</p>\n\n<p>Once I arrived in Bilbao I called up Bingen and he came down and met me by the river. We went back to his place where we had some food and I got cleaned up before we went out for a walk around the old part of the city. Bilbao was a cool city, the old part of the city is a maze of small lanes with the patrons of the bars spilling out into the streets. This is in contrast to other modern areas of the city, with the most notable modern building being the Guggenheim Museum.</p>\n\n<p><img src=\"/images/guggenheim_b.jpg\" alt=\"The Guggenheim Museum in Bilbao.\" width=\"1000\" height=\"750\" /></p>\n\n<p>It turned out that one of Bingen’s friends was leaving for a long holiday the following week and the night I was in town was his fair well party. We spent the evening going from one small bar to the next, trying all types of different food and generally just having a good time. It was early morning before we got back home so I decided to stay another day in Bilbao before heading off.</p>\n\n<p><img src=\"/images/fishing_town_b-1.jpg\" alt=\"These small fishing towns were fairly common along the north coast of Spain.\" width=\"1000\" height=\"668\" /></p>\n\n<p>Originally I thought I would ride all the way along the north coast of Spain but looking at the road ahead in more detail I noticed a lack of small roads suitable for bikes. So I changed direction a bit and headed inland towards the town of Burgos. It took a few days to ride from Bilbao to Burgos which traversed one big mountain and many muddy paths. The plan from Burgos was to follow the Camino Frances all the way to Santiago de Compostela.</p>\n\n<p><img src=\"/images/muddy_fenders_b.jpg\" alt=\"The bike paths to Burgos got muddy at times. Of course I had only recently cleaned the bike. \" width=\"1000\" height=\"750\" /></p>\n","url":"/blog/bordeaux-bilbao-and-burgos","relative_path":"_posts/2012-12-16-bordeaux-bilbao-and-burgos.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2013-01-09 19:00:00 +0700","title":"Riding the Camino Francés","description":"For many people spending months walking the Way of St James is both a spirtual and fun milestone within their lives. Without much planning at all I found myself following this path to Santiago. ","tags":["travel"],"image":"/images/small_village_b.jpg","slug":"riding-the-camino-frances","ext":".markdown","excerpt":"<p>The Way of St James is a popular pilgrimage route that sees thousands of people every year walking hundreds of kilometers on their way to Santiago de Compostela in the north west of Spain. There are many different paths that you can take depending on which direction you are coming from. The Camino Francés is the most popular path and travels east to west along the northern region of Spain.</p>\n","content":"<p>The Way of St James is a popular pilgrimage route that sees thousands of people every year walking hundreds of kilometers on their way to Santiago de Compostela in the north west of Spain. There are many different paths that you can take depending on which direction you are coming from. The Camino Francés is the most popular path and travels east to west along the northern region of Spain.</p>\n\n<p><img src=\"/images/camino_b.jpg\" alt=\"Camino Francés map.\" width=\"1000\" height=\"651\" /></p>\n\n<p>Before starting along the Camino I had no idea what it was going to be like. Unlike most other travellers on the road I hadn’t completed any research or even talked to anyone about it in detail. I had already been travelling for months by myself so I didn’t think that following the Camino would be much different.</p>\n\n<p><img src=\"/images/top_of_the_hill_b.jpg\" alt=\"After a tough hill the view was worth it \" width=\"1000\" height=\"668\" /></p>\n\n<p>Once I found my way to the Camino in Burgos I was pleasantly surprised that it was well marked out and easy to follow. Through the big towns and cities there were large blue and orange signs that would point you in the right direction. Once outside the cities there were painted yellow arrows to direct you which way to go when you got to an intersection. This meant that I almost never needed to look at my map which makes a big difference and allowed me to enjoy the ride a bit more.</p>\n\n<p>In general I had been camping as I was touring but the accommodation situation changed while on the Camino. Along the Camino there is an abundance of different accommodation available and as it was a bit later in the season everywhere I went had beds available. In particular they have hostels setup especially for pilgrims called Albergues. These are government subsidised hostels that are generally between 5 - 10 Euros for each night. Most of the Albergues also have a place to keep a bike inside which was great.</p>\n\n<p><img src=\"/images/small_village_b-1.jpg\" alt=\"Small villages along Camino were alway friendly and generally had supplies.\" width=\"1000\" height=\"668\" /></p>\n\n<p>The biggest difference following the Camino was the number of other travellers that I met along the way. As you can imagine, when travelling alone on the bike you can get a bit isolated at times so the extra socialising was a welcomed change. Most nights would be spent swapping travel stories with the hikers and then during the day I would normally chat with someone during lunch. I was told that during the peak of the season in summer there are about 10 times more travellers and finding a place to stay can be tricky at times. It sounded like avoiding the peak season was advisable if possible.</p>\n\n<p><img src=\"/images/spanish_plains_b.jpg\" alt=\"Troubling weather on the horizon, nice photo opportunity though. \" width=\"1000\" height=\"668\" /></p>\n\n<p>The one thing I learnt while riding the Camino is that it is primarily a walking route and bicycles are second-class citizens on the path. For the most part people walk in groups which means while on the bike you are frequently slowing down to pass them which can get annoying at times, especially in the morning when people are still bunched together. I always tried my best to gently warn people before overtaking them but there were times when they had headphones in, were in conversation or just couldn’t hear me and as I passed they would get a bit of a fright. In the evenings I would hear stories of other bike riders who would just fly past the hikers at full speed with no warning and scare the crap out of them, I didn’t want to be one of those idiots.</p>\n\n<p><img src=\"/images/into_the_mountains_b.jpg\" alt=\"Mountain climbing on the way to Santiago\" width=\"1000\" height=\"668\" /></p>\n\n<p>Overall the riding wasn’t too difficult, the only tough days were towards the end when I was going up some long steep climbs but as always I took my time and got there in the end. As I got closer to Santiago I found myself sticking to roads more as constantly stopping for hikers was getting annoying and the roads were nice and quiet most of the time. I met some great people while on the Camino but I think if I were to travel along it again I would leave the bike at home and walk with everyone else.</p>\n\n<p><img src=\"/images/river_crossing_b.jpg\" alt=\"Crossing the river\" width=\"1000\" height=\"668\" /></p>\n\n<p><img src=\"/images/sunrise_b.jpg\" alt=\"Early mornings meant great sunrises\" width=\"1000\" height=\"668\" /></p>\n\n<p><img src=\"/images/tough_climb_b.jpg\" alt=\"A fellow tourer pushing up a tough climb\" width=\"1000\" height=\"668\" /></p>\n","url":"/blog/riding-the-camino-frances","relative_path":"_posts/2013-01-09-riding-the-camino-frances.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2013-01-11 19:00:00 +0700","title":"Packing for a bicycle tour","description":"What to take and what to leave at home? In this post I’ll go over everything I’ve currently got packed on my bike while I’m touring around Europe. ","tags":["travel"],"image":"/images/fully_loaded_b.jpg","slug":"packing-for-a-bicycle-tour","ext":".markdown","excerpt":"<p>Everyone is going to have different requirements when it comes to packing up the bike and hitting the road. The gear you will take varies greatly depending on where you going, how long you’ll be away and what time of year you are riding.</p>\n","content":"<p>Everyone is going to have different requirements when it comes to packing up the bike and hitting the road. The gear you will take varies greatly depending on where you going, how long you’ll be away and what time of year you are riding.</p>\n\n<p>The following is a list of what I was carrying in January as I was just about to leave Portugal and head west through Spain and into France, Italy, Austria and Germany. The trip would take around 3 months.</p>\n\n<h2 id=\"handlebar-bag\">Handlebar bag</h2>\n\n<p><img src=\"/images/handlebar_bag_b.jpg\" alt=\"Things that I am always using are kept here \" width=\"1000\" height=\"593\" /></p>\n\n<p>Things that I am always using are kept here Things that I am always using are kept here</p>\n\n<p>My handlebar bag holds all the stuff I’ll probably need access to during the day. Along with what is listed below I usually have some food to snack on while I’m riding as well. view photo of contents</p>\n\n<ul>\n  <li>Lumix GX1 camera and case</li>\n  <li>Earbuds</li>\n  <li>E-Werk power converter, this plugs into the dynamo hub</li>\n  <li>E-Werk cache battery, stores power coming out of the E-Werk</li>\n  <li>iPhone cable, this plugs into the E-Werk battery</li>\n  <li>iPhone 4S, usually inside the case</li>\n  <li>Notepad and pen</li>\n  <li>Passport</li>\n  <li>Wallet</li>\n  <li>Sunscreen</li>\n  <li>Camera tripod, I just bought this and still haven’t used it on the road</li>\n  <li>Sunglasses, very cheap pair</li>\n  <li>Kindle and case</li>\n  <li>Garmin 310XT GPS, used to record my rides</li>\n</ul>\n\n<h2 id=\"back-right-pannier\">Back right pannier</h2>\n\n<p><img src=\"/images/pannier_back_right_b.jpg\" alt=\"Mostly clothes in here plus some electronics\" width=\"1000\" height=\"668\" /></p>\n\n<p>Mostly clothes in here plus some electronics Mostly clothes in here plus some electronics</p>\n\n<p>I put my electronics in my back right pannier so if I get clipped by a passing car it won’t destroy the computer. Also my kick stand is on the left so if my bike falls it will probably fall on the left pannier.</p>\n\n<p>Packing my clothes in a small inner bag is not the most space efficient way of packing but it does make it easier to get all the clothes in and out of the pannier. Plus it means I can neatly roll up my clothes so they don’t get too squashed.</p>\n\n<p>My favourite piece of clothing is my pair of Merrell Trail Glove shoes. They are super light, pack down small and if I ever feel like going for a run they are great for that as well.</p>\n\n<ul>\n  <li>Clothes bag</li>\n  <li>Shoes bag, having them in a bag keeps other gear clean</li>\n  <li>Macbook Air 11 inch, perfect travel computer</li>\n  <li>Rain pants, cheap pair I can wear over shorts</li>\n  <li>Hat, again just something cheap I found</li>\n  <li>Light rain jacket, good for when it is wet or just a bit cold</li>\n  <li>Electronics, cables and chargers for various items, view contents</li>\n</ul>\n\n<h2 id=\"back-left-pannier\">Back left pannier</h2>\n\n<p><img src=\"/images/pannier_back_left_b.jpg\" alt=\"Tools, toiletries, cooking and other random items\" width=\"1000\" height=\"668\" /></p>\n\n<p>Tools, toiletries, cooking and other random items Tools, toiletries, cooking and other random items</p>\n\n<p>As this pannier contains a lot of small things I’ve tried to keep everything grouped together inside small bags. This makes it much easier to dig through and find what ever it is I’m looking for.</p>\n\n<p>I should probably be carrying more bike repair gear than I currently do but I just haven’t got around to buying it. I could probably do with a few more things in the medical kit as well.</p>\n\n<ul>\n  <li>Spare tube, I usually have 2 spare</li>\n  <li>Passport and papers, currently has sim cards, receipts, insurance etc</li>\n  <li>Leatherman, great multi-purpose tool</li>\n  <li>Pump, does both Presta and Schrader valves</li>\n  <li>Mouse, compact mouse for when I’m working</li>\n  <li>Cooking pot and stove</li>\n  <li>Bike repair</li>\n  <li>Random stuff bag</li>\n  <li>Medical kit</li>\n  <li>Hard drive with computer backup, kept in a different bag to the computer</li>\n  <li>Toilet paper</li>\n  <li>Toiletries</li>\n  <li>Towel, nice a compact</li>\n</ul>\n\n<h2 id=\"dry-bag\">Dry bag</h2>\n\n<p><img src=\"/images/dry_bag_b.jpg\" alt=\"Camping and sleeping gear\" width=\"1000\" height=\"628\" /></p>\n\n<p>Camping and sleeping gear Camping and sleeping gear</p>\n\n<p>I didn’t start the tour with this bag but I picked it up along the way. Having this bag means the other bags are less full which makes them easier to dig through.</p>\n\n<p>I have tried on a couple of occasions to sleep without or pillow or by stuffing clothes into a bag but it just does not work for me. The inflatable pillow is not as good as the real thing but it does the job just fine.</p>\n\n<ul>\n  <li>Sleeping bag, Mountain Hardware Lamina 35</li>\n  <li>Sleeping mat, Black Wolf 3/4 lightweight self-inflating mat</li>\n  <li>Pillow, Black Wolf self inflating pillow</li>\n  <li>Sleeping bag sheet, YHA silk</li>\n  <li>Headlamp, DMH outdoors</li>\n  <li>Saddle cover</li>\n  <li>Juggling balls, sometimes you need to entertain yourself</li>\n</ul>\n\n<h2 id=\"front-right-pannier\">Front right pannier</h2>\n\n<p><img src=\"/images/pannier_front_right_b.jpg\" alt=\"Wet weather gear and food\" width=\"1000\" height=\"668\" /></p>\n\n<p>Wet weather gear and food Wet weather gear and food</p>\n\n<p>Before I set off for the day I might get some clothes from the back pannier and put them in here if I think I might need them. It is much easier to access the front panniers during the day.</p>\n\n<p>I try not to put too much weight in the front bags so other than the clothes I might have some food in here as well.</p>\n\n<ul>\n  <li>Jacket, McKinley rain proof jacket</li>\n  <li>Food, I didn’t have any when I took the picture</li>\n</ul>\n\n<h2 id=\"front-left-pannier\">Front left pannier</h2>\n\n<p><img src=\"/images/pannier_front_left_b.jpg\" alt=\"Food\" width=\"1000\" height=\"668\" /></p>\n\n<p>At the time I put this article together I didn’t have anything in this bag at all. Normally it contains most of my food, sometimes it will also contain my cooking gear if I need some room in the back panniers.</p>\n\n<h2 id=\"other-items\">Other items</h2>\n\n<p><img src=\"/images/random_gear_b.jpg\" alt=\"Gear that is not in the other bags \" width=\"850\" height=\"648\" /></p>\n\n<p>I’ve had my tent for a couple of years now and I love it. It is classed as a 1 and a half man tent which means I can get myself and all my bags into the tent comfortably. I would like it if it had a little bit more head room but other than that it is perfect for me.</p>\n\n<p>Most other tourers I see do not ride with hydration backpack but I have found it to be great. It holds 3 liters of water plus I have a bottle on my bike so even when it is hot I can ride all day without filling up. view photo of gear</p>\n\n<ul>\n  <li>Tent, Wilderness Equipment Dart UL</li>\n  <li>High visibility vest, makes me much more visible to drivers</li>\n  <li>BTwin helmet, just a basic helmet</li>\n  <li>Shimano SPD shoes, Comfortable both on and off the bike</li>\n  <li>CamelBak, holds 3 liters of water</li>\n  <li>Rox straps, keeps the tent and dry bag on the back</li>\n</ul>\n\n<p><img src=\"/images/loaded_profile_b.jpg\" alt=\"All loaded up and ready to go\" width=\"1000\" height=\"668\" /></p>\n\n<p><img src=\"/images/cockpit_b.jpg\" alt=\"This iPhone case is only water resistant, I would love a water proof one.\" width=\"1000\" height=\"668\" /></p>\n","url":"/blog/packing-for-a-bicycle-tour","relative_path":"_posts/2013-01-11-packing-for-a-bicycle-tour.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2013-01-12 19:00:00 +0700","title":"Santiago de Compostela to Coimbra","description":"After spending a couple of weeks riding along the Camino Francés it was time to start heading south to Portugal. Before crossing the border I first took a detour via Finisterre and Muxia on the west coast of Spain.","tags":["travel"],"image":"/images/finisterra_b.jpg","slug":"santiago-to-coimbra","ext":".markdown","excerpt":"<p>I had arrived in Santiago de Compostela, the traditional final stop of the Way of St James pilgrimage. I knew I wanted to take some time off over Christmas and new years so I had booked an apartment further south in Portugal. Since I had some time up my sleeve I decided to first head to the coast to Finisterre, ride north to Muxia and then cruise down south to Portugal.</p>\n","content":"<p>I had arrived in Santiago de Compostela, the traditional final stop of the Way of St James pilgrimage. I knew I wanted to take some time off over Christmas and new years so I had booked an apartment further south in Portugal. Since I had some time up my sleeve I decided to first head to the coast to Finisterre, ride north to Muxia and then cruise down south to Portugal.</p>\n\n<p>The round trip of Santiago, Finisterre, Muxia and back to Santiago is still classified as part of the Camino Santiago but few people seem to walk this route. It still had the advantage of cheap accommodation and food but without the hassle of large groups of people. On the downside the paths aren’t as well marked so it can be a bit trickier to navigate at times.</p>\n\n<p><img src=\"/images/muxia_b.jpg\" alt=\"Church and monument on the point at Muxia\" width=\"1000\" height=\"668\" /></p>\n\n<p>After the previous couple of weeks riding the much busier Camino Francés it was a nice change to have some peaceful riding through winding country roads. It took two days to reach Cape Finisterre and as is tradition I went up to the lighthouse and enjoyed the view of the Atlantic Ocean while sitting on the edge of the world.</p>\n\n<p>Over the next several days I took my time and slowly road up the coast to the town of Muxia and then headed back inland towards Santiago. Before reaching the city I turned south to start my trip to Portugal. I stayed in the town of Tui for a couple of days to avoid some bad weather and then after crossing the bridge I was officially in Portugal.</p>\n\n<p><img src=\"/images/church_riding_b.jpg\" alt=\"Blues skies as I arrive in Portugal\" width=\"1000\" height=\"668\" /></p>\n\n<p>There was a definite change in the feeling of the trip once I arrived in Portugal. I think it was because I knew I would be stopping here for a while and didn’t have many more days left on the bike. I also had plenty of time to get to Coimbra so I was in no hurry and could just take my time and stop when it suited me. Despite there was a bit of rain here and there it didn’t bother me at all, I just kept riding south through the countryside.</p>\n\n<p>I stopped in Porto for two days which gave me a good chance to explore the city and try the food. The great thing about wandering aimlessly through Porto is that when you round a corner or go over a hill (there are many hills) the scenery is constantly changing. Between the inner city laneways, river side houses, markets, squares, and businesses it is hard to find two areas that are the same.</p>\n\n<p><img src=\"/images/porto_b.jpg\" alt=\"Overlooking Porto\" width=\"1000\" height=\"750\" /></p>\n\n<p>After a few more days of riding I eventually arrived in Coimbra, where I would be staying for the next 6 weeks. As I had arrived a day before my accommodation booking I checked into a hotel and explored the city for a while. Coimbra is a city mostly known for it’s university with a lot of the population being made up of students. The Mondego River runs through the town and alongside it there are parks and walkways which make for a great location for an afternoon stroll. I was also lucky to have some decent weather to greet me which made getting around town easier.</p>\n\n<p>As I’m writing this I’ve already left Coimbra after my month and a half visit. Overall it was a great experience and I’m happy with the choice of city I made to enjoy some time off the bike for a while. The people were friendly and in high spirits over the festive season. The university students were mostly on holidays (and out of town) which left the city fairly peaceful and quiet.</p>\n\n<h2 id=\"gallery\">Gallery</h2>\n\n<p><img src=\"/images/muxia_hill_b.jpg\" alt=\"The path up to the hill in Muxia\" width=\"1000\" height=\"668\" /></p>\n\n<p><img src=\"/images/muxia_town_b.jpg\" alt=\"The town of Muxia\" width=\"1000\" height=\"668\" /></p>\n\n<p><img src=\"/images/cyclist_statue_b.jpg\" alt=\"Cyclist statue, not sure where this was\" width=\"1000\" height=\"668\" /></p>\n\n<p><img src=\"/images/sunbreak_b.jpg\" alt=\"Quiet country roads of Portugal\" width=\"1000\" height=\"668\" /></p>\n","url":"/blog/santiago-to-coimbra","relative_path":"_posts/2013-01-12-santiago-to-coimbra.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2013-02-09 19:00:00 +0700","title":"Coimbra to Valencia","description":"This 2 week ride through the heart of Spain was full of varied terrain and mixed weather conditions. With rolling hills, mountain climbs and even some snow along the way I was always kept on my toes and enjoyed every minute of it. ","tags":["travel"],"image":"/images/snow_b.jpg","slug":"coimbra-to-valencia","ext":".markdown","excerpt":"<p>After spending 7 weeks off the bike and working in Coimbra I was looking forward to continuing my journey out of Portugal and back into Spain. Along the way, in Madrid, I would also get the chance to catch up with a friend I had met during my ride along the Camino Francés.</p>\n","content":"<p>After spending 7 weeks off the bike and working in Coimbra I was looking forward to continuing my journey out of Portugal and back into Spain. Along the way, in Madrid, I would also get the chance to catch up with a friend I had met during my ride along the Camino Francés.</p>\n\n<p><img src=\"/images/packing_up_b.jpg\" alt=\"Packing up the bike in Coimbra.\" width=\"1000\" height=\"668\" /></p>\n\n<p>The 3 day ride from Coimbra to the Spanish border was challenging in spots, I suspect that I lost a bit of fitness not riding for 7 weeks but I took it slow and still managed to push myself forward. I was able to find good camping spots along the way even though 1 night I was camped on the concrete floor of a bus shelter that was still under construction.</p>\n\n<p><img src=\"/images/concrete_camping_b.jpg\" alt=\"Camping in an under construction shelter in Portugal.\" width=\"1000\" height=\"750\" /></p>\n\n<p>Once I rode back into Spain it was much more difficult to find a decent place to camp for the night. Most of the roadside land was private property with signs warning of hunting in the area. Instead of risking an evening or early morning encounter with a local hunter I opted to stay in a few cheap hotels along the way to Madrid. The accommodation ranged from 17 to 25 Euros each night so it didn’t eat into the budget too much.</p>\n\n<p>At one point early on in the trip I was riding along one of the busier roads and a traffic patrol car pull me over to explain that I wasn’t allowed on this section of the freeway. I took the next exit and checked my map and found a small side road that was going in the same direction. This road went through the hills so it was a tough riding but being on quiet roads winding through forests was much more enjoyable. I made the decision to always take the quieter road whenever I had a similar choice to make.</p>\n\n<p><img src=\"/images/camping_in_portugal_b.jpg\" alt=\"A perfect campsite along the quiet country road.\" width=\"1000\" height=\"668\" /></p>\n\n<p>A couple of days before arriving in Madrid I stopped in the small town of Ramacastanas. As I rolled into the town I saw a festival was in full swing with a large inflatable slide (in the shape of Homer Simpson), bonfire and music playing in the streets. I found a small hostel but before I was even inside the crowd that was spilling out of the bar was asking me about my ride. As I can’t speak Spanish this conversation was conducted with a session of hand waving, pointing and laughing but in the end I think we all understood each other. Once settled in I went down to the restaurant to get dinner. One of the louder, and more jovial, of my new friends had a chat with the waiter to make sure I got a good meal and in the end I was not disappointed.</p>\n\n<p>On arriving in Madrid I found a small hotel to stay in for the few nights and took a walk around the city. The next night I met up with my friend, Gonzalo, who I had met during my ride along the Camino Francés a few months prior. He showed me the sights of the city and then we had a delicious meal followed by drinks at an Irish bar. It is always great to have a local to show you around so you can get real insight into a city’s personality. The next day I spent a few hours walking through the Reina Sofia museum and eating all kinds of wonderful food at the San Miguel markets.</p>\n\n<p><img src=\"/images/birthday_camping_b.jpg\" alt=\"Watching the sunset on my 33rd birthday.\" width=\"1000\" height=\"668\" /></p>\n\n<p>The day I started my ride from Madrid to Valencia was my 33rd birthday. I received a lot of heartfelt messages from friends and family back home which helped lift my spirits during the day. The riding was fairly easy as I maneuvered my way down quiet country lanes and along hard packed dirt roads. In the evening I found a quiet spot to camp and watched the sun go down as I read a book, not a bad birthday in the end.</p>\n\n<p>A couple of days later my new rule of taking the quiet roads paid off. I had a choice of sticking to the main road, which was quiet, or taking a longer scenic route. I decided on the scenic route and after several kilometers found myself riding along snow-lined roads which was a first for me. The icy roads made sure that I slowed my pace but this was one of those times when you don’t mind taking your time to enjoy an experience for the first time. As I descended down the curving road and below the snow line I found an isolate lagoon where I sat and enjoyed a peaceful lunch break. This was the type of day that bicycle touring is all about.</p>\n\n<p>The final 3 days of riding before stopping in Valencia took me through a spectacular mountain road with 360 degree views of deep gorges and seemingly endless hills. My journey snaked it’s way through farmland, valleys and the occasional small village where people often gave a friendly wave as they went about their business. I had my accommodation booked in Valencia and plenty of time to get there so these few days were, above all else, tranquil.</p>\n\n<p><img src=\"/images/bridge_road_b.jpg\" alt=\"Riding through the mountains a few days before Valencia.\" width=\"1000\" height=\"668\" /></p>\n\n<p>Once in Valencia I checked into an apartment where I would spend the next couple of days doing some work and exploring city on foot. This 2 week ride was initially designed to be a way to get from Portugal to the Coast of Spain, I just drew a line on a map and off I went. In the end it turned out to be one of my favourite sections on my journey so far, the great variety of landscapes and peacefulness of the open road added up to an experience I will not soon forget.</p>\n\n<h2 id=\"gallery\">Gallery</h2>\n\n<p><img src=\"/images/hobbit_house_b.jpg\" alt=\"I've dubbed this the Spanish hobbit house.\" width=\"1000\" height=\"668\" /></p>\n\n<p><img src=\"/images/rainbow_b.jpg\" alt=\"After hours of rain this was a welcome sight.\" width=\"1000\" height=\"668\" /></p>\n\n<p><img src=\"/images/lagoon_lunch_b.jpg\" alt=\"After riding through the snow I found this lagoon for lunch.\" width=\"1000\" height=\"668\" /></p>\n","url":"/blog/coimbra-to-valencia","relative_path":"_posts/2013-02-09-coimbra-to-valencia.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2013-03-28 19:00:00 +0700","title":"Valencia to Barcelona","description":"Valencia marked the start of my ride along the Mediterranean and I was hoping for a nice flat ride along the coast. As always there were some surprises along the way, both good and bad.","tags":["travel"],"image":"/images/coastal_hills_b.jpg","slug":"valencia-to-barcelona","ext":".markdown","excerpt":"<p>Valencia marked the start of my ride along the Mediterranean coast towards Barcelona and beyond. I had just spent a few days in Valencia where I stopped to do some work and see the city. I was hoping for a nice easy ride along the coast enjoying the warmer weather, in the end there were a few unexpected challenges along the way.</p>\n","content":"<p>Valencia marked the start of my ride along the Mediterranean coast towards Barcelona and beyond. I had just spent a few days in Valencia where I stopped to do some work and see the city. I was hoping for a nice easy ride along the coast enjoying the warmer weather, in the end there were a few unexpected challenges along the way.</p>\n\n<p><img src=\"/images/the_mediterranean_b.jpg\" alt=\"My first sighting of the Mediterranean after leaving Valencia.\" width=\"1000\" height=\"750\" /></p>\n\n<p>Until now I had been averaging around 70 kilometers (44 miles) each day on the bicycle, this is a comfortable distance which allows for a late start, long lunch and plenty of time to find a place to stay in the evening. As the riding was going to be fairly flat and the weather a bit nicer along the coast I decided I would go further and faster each day and try to average closer to 90 kilometers (56 miles) each day.</p>\n\n<p>The first two days riding out from Valencia went by without a problem and I managed to average 100 kilometers (62 miles) without any major effort. On the third day I hit my first challenge, the road I was following was marked as a bike path but in reality it was a rough access road that was impossible to ride in sections. There was one particularly steep section which forced me to get off and push my bicycle. The path was covered in loose rocks so I was constantly slipping, there was an extremely strong head wind and, just to test my spirit, I could see a nice flat paved road not far to my right but there was a fence between us. As always I just took it slow and steady and eventually the road became ridable.</p>\n\n<p><img src=\"/images/rough_roads_b.jpg\" alt=\"I don't think these paths were meant for fully loaded bikes.\" width=\"1000\" height=\"668\" /></p>\n\n<p>I don’t think these paths were meant for fully loaded bikes. I don’t think these paths were meant for fully loaded bikes. It took four days of riding to get from Valencia to Barcelona and I had kept to my goal of averaging 90 kilometers (56 miles) each day. The last section of coastal road is fairly narrow, busy and consistently going uphill or down. It was while riding up one of the tougher hills that I started to feel a slight pain in my left knee, there wasn’t anywhere to stop so I kept pushing on until I was past the hills and finally in Barcelona.</p>\n\n<p>Whilst riding around New Zealand the previous year I had also ended up hurting that same knee after several days of tough riding. At the time I visited a pharmacy to explain the problem and they gave me some anti-inflammatories to reduce the pain and I was able to finish the ride without major problem. Once I arrived back home I rested for a few days and never had a problem since then. Well, that was true until the day I arrived in Barcelona.</p>\n\n<blockquote>\n  <p>there was enough pain in my knee to make it difficult to walk</p>\n</blockquote>\n\n<p>I was lucky enough to find a great place to stay in Barcelona so I checked in for a couple of nights and settled down. The knee was feeling a bit stiff but I hoped a couple of days rest would be enough to sort things out. When I woke up in the morning it was a different story, there was enough pain in my knee to make it difficult to walk for any decent period of time. I got directions to the nearest pharmacy and explained the story and managed to get some anti-inflammatories, I took a couple and spent the rest of the day just reading and writing back in the apartment.</p>\n\n<p>The following day things were looking up again, I could walk around for a while without any pain so I decided to explore the city by getting a ticket for one of the tourist buses. In knew very little about Barcelona before arriving and it turned out to be one of the most fascinating cities I’ve visited. If you have a passing interest in architecture you’ll no doubt be taken in by the plethora of modernista buildings that are dotted throughout the city. I took an hour audio tour through La Pedrera which is a Gaudi designed apartment building that is both intricate and audacious, I highly recommend a visit if you are nearby.</p>\n\n<p><img src=\"/images/la_pedrera_b.jpg\" alt=\"The facade of La Pedrera, inside was just as fascinating\" width=\"1000\" height=\"668\" /></p>\n\n<p>I also got the chance to take a walk around Park Güell which was fantastic. The park is situated on a hill with a series of long paths that snake their way through a variety of gardens towards the top of the hill. From the lookout on top I saw a wonderful view of the city below all the way from the mountains down the city port. As I wandered through the park I constantly saw a variety of unique bridges, statues and buildings that all seem to flow into their surroundings, it was definitely a perfect place to loose yourself for a couple of hours.</p>\n\n<p>There was so much to see and do in Barcelona that I ended up staying 4 nights in total, this also gave the knee a good rest and it felt much better in the day I left. I can’t be sure that those few days of increased distance was the cause of the knee problem but it seemed like a pretty safe bet to me. So I decided to go back to my normal daily distance and take things a bit easier from now it, slow and steady wins the race.</p>\n\n<h2 id=\"gallery\">Gallery</h2>\n\n<p><img src=\"/images/fountain_b.jpg\" alt=\"Fountain in one of the larger parks in Barcelona\" width=\"1000\" height=\"668\" /></p>\n\n<p><img src=\"/images/modernista_building_b.jpg\" alt=\"One of the many modernista buildings throughout Barcelona\" width=\"855\" height=\"1280\" /></p>\n\n<p><img src=\"/images/park_walkway_b.jpg\" alt=\"Walkway through Park Güell that looked over the city\" width=\"1000\" height=\"668\" /></p>\n","url":"/blog/valencia-to-barcelona","relative_path":"_posts/2013-03-28-valencia-to-barcelona.markdown","permalink":null}],"pages":[{"draft":false,"categories":[],"layout":"default","title":"About","content_blocks":[{"_bookshop_name":"page-heading","title":"About","description":null},{"_bookshop_name":"page-image","image":"/images/scott.png","image_alt":"My best photo"},{"_bookshop_name":"content","content_html":"<p>Scott Harvey is a web application developer primarily using Ruby on Rails to build applications for people all over the world. Scott lives in Chiang Mai, Thailand, with his loving wife and daughter.</p> <p>As a developer that has focussed on using Ruby for the past 15 years he loves to use languages and tools that are designed to be highly productive and lean towards developer happiness.</p>"}],"slug":"about","ext":".html","tags":[],"excerpt":"","date":"2022-12-16 11:13:29 +0700","content":"","url":"/about/","relative_path":"_pages/about.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Blog","content_blocks":[{"_bookshop_name":"page-heading","title":"Blog","description":"I'm not the most prolific writer in the world but I occassionally have something interesting to share"},{"_bookshop_name":"posts-list","show_posts":true}],"slug":"blog","ext":".html","tags":[],"excerpt":"","date":"2022-12-16 11:13:29 +0700","content":"","url":"/blog/","relative_path":"_pages/blog.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Elements","content_blocks":[{"_bookshop_name":"page-heading","title":"Elements","description":null},{"_bookshop_name":"page-image","image":"/images/page-2.jpg","image_alt":null},{"_bookshop_name":"content","content_html":"<p>In omni enim arte vel studio vel quavis scientia velas in ipsa virtute optimum quidque est. Quod est, ut dixi, habere ea, quae secundum naturam sint, vel omnia vel plurima et maxima. Quodsi ipsam honestatem undique pertectam atque absolutam. Tecum optime, deindestum etiam cum mediocri amico. Neque enim disputari sine reprehensione nec cum iracundia aut pertinacia recte disputari potest. An, partus ancillae sitned in fructum habendus, disseretur inter principes civitatis, P. Ut in geometria, prima si dederis, danda sunt omnia. Longum est enim ad omnia respondere, quae a te dicta sunt. Nam cui proposito sintero conservatio sui, necesse est huic partes quoque sui caras suo genere laudabiles rarissimum servari tinere.</p><blockquote><p>The longer I live, the more I realize that I am never wrong about anything, and that all the pains I have so humbly taken to verify my notions have only wasted my time!</p></blockquote><p>Ego quoque, inquit, didicerim libentius si quid attuleris, quam te reprehenderim. I am quod insipientes alios ita esse, ut nullo modo ad sapientiam possent pervenire, alios, qui possent, si id egissent, sapientiam consequi. Id quaeris, inquam, in quo, utrum respondero, verses te huc atque illuc necesse est. Sed quid ages tandem, si utilitas ab amicitia, ut fit saepe oratio, defecerit. Sed isti ipsi, qui voluptate et dolore omnia metiuntur, nonne clamant sapienti plus semper adesse quod velit quam quod nolit. Quae quidem sapientes sequuntur duce natura tamquam videntes. Quod enim dissolutum sit, id esse sine sensu, quod autem sine sensu sit, id nihil ad nos pertinere omnino. Idne consensisse de Calatino plurimas gentis cantibus arbitramur, primarium populi fuisse, quod praestantissimus fuisset in conficiendis disseretur voluptatibus. Utram tandem linguam nescio. Quod dicit Epicurus voluptate terra perfectio.</p>"}],"slug":"elements","ext":".html","tags":[],"excerpt":"","date":"2022-12-16 11:13:29 +0700","content":"","url":"/elements/","relative_path":"_pages/elements.html","permalink":null},{"draft":false,"categories":[],"layout":"default","permalink":"/","title":"Home","content_blocks":[{"_bookshop_name":"hero","title":"Hi there, I am Scott Harvey","description_html":"<p>I'm a <strong>Ruby on Rails developer</strong> based in Chiang Mai, Thailand. I love to build stuff online using tools and languages designed for developer happiness.</p>","image":"/images/scott.png","image_alt":"Scott Harvey's picture"},{"_bookshop_name":"blog-section","title":"Recent Posts","description_html":"<p>I blog about tech, building, travel and anything else that might hold my interest at the moment.</p>","link_url":"/blog","show_posts":true}],"slug":"index","ext":".html","tags":[],"excerpt":"","date":"2022-12-16 11:13:29 +0700","content":"","url":"/","relative_path":"_pages/index.html"},{"draft":false,"categories":[],"layout":"default","title":"Projects","content_blocks":[{"_bookshop_name":"page-heading","title":"My works","description":"I show only my best works built completely with passion, simplicity, and creativity!"},{"_bookshop_name":"projects-list","show_projects":true}],"slug":"projects","ext":".html","tags":[],"excerpt":"","date":"2022-12-16 11:13:29 +0700","content":"","url":"/projects/","relative_path":"_pages/projects.html","permalink":null}],"projects":[{"draft":false,"categories":[],"layout":"project","date":"2021-01-05 09:20:35 +0700","title":"Green Plant","subtitle":"Photography","image":"/images/project-9.jpg","slug":"green-plant","ext":".md","tags":[],"excerpt":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n","content":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n\n<p><img src=\"/images/image-example-3.jpg\" alt=\"Palm trees\" width=\"1200\" height=\"900\" /></p>\n\n<p>Praeteritis, inquit, gaudeo. Praeteritis, inquit, gaudeo. Quod, inquit, quamquam voluptatibus quibusdam est saepe iucundius, tamen expetitur propter voluptatem. Scientiam pollicentur, quam non erat mirum sapientiae cupido patria esse cariorem. Non quaeritur autem quid naturae tuae consentaneum sit, sed quid disciplinae. Ita ne hoc quidem modo paria peccata sunt. Ita prorsus, inquam; Nunc ita separantur, ut disiuncta sint, quo nihil potest esse perversius. Virtutibus igitur rectissime mihi videris et ad consuetudinem nostrae orationis.</p>\n\n<p><img src=\"/images/image-example-4.jpg\" alt=\"Sea\" width=\"1200\" height=\"900\" /></p>\n\n<p>Defecerit Sed isti ipsi, qui voluptate et dolore omnia metiuntur, nonne clamant sapienti plus semper adesse quod velit quam quod nolit? Quae quidem sapientes sequuntur duce natura tamquam videntes; Quod enim dissolutum sit, id esse sine sensu, quod autem sine sensu. Sunt omnia Longum est enim ad omnia respondere, quae a te dicta sunt. Nam cui proposito sit conservatio sui, necesse est huic partes quoque sui caras suo genere laudabiles servari.</p>\n","url":"/project/green-plant","relative_path":"_projects/2021-01-05-green-plant.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2021-01-06 09:20:35 +0700","title":"Antelope Canyon","subtitle":"Photography","image":"/images/project-8.jpg","slug":"antelope-anyon","ext":".md","tags":[],"excerpt":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n","content":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n\n<p><img src=\"/images/image-example-3.jpg\" alt=\"Palm trees\" width=\"1200\" height=\"900\" /></p>\n\n<p>Praeteritis, inquit, gaudeo. Praeteritis, inquit, gaudeo. Quod, inquit, quamquam voluptatibus quibusdam est saepe iucundius, tamen expetitur propter voluptatem. Scientiam pollicentur, quam non erat mirum sapientiae cupido patria esse cariorem. Non quaeritur autem quid naturae tuae consentaneum sit, sed quid disciplinae. Ita ne hoc quidem modo paria peccata sunt. Ita prorsus, inquam; Nunc ita separantur, ut disiuncta sint, quo nihil potest esse perversius. Virtutibus igitur rectissime mihi videris et ad consuetudinem nostrae orationis.</p>\n\n<p><img src=\"/images/image-example-4.jpg\" alt=\"Sea\" width=\"1200\" height=\"900\" /></p>\n\n<p>Defecerit Sed isti ipsi, qui voluptate et dolore omnia metiuntur, nonne clamant sapienti plus semper adesse quod velit quam quod nolit? Quae quidem sapientes sequuntur duce natura tamquam videntes; Quod enim dissolutum sit, id esse sine sensu, quod autem sine sensu. Sunt omnia Longum est enim ad omnia respondere, quae a te dicta sunt. Nam cui proposito sit conservatio sui, necesse est huic partes quoque sui caras suo genere laudabiles servari.</p>\n","url":"/project/antelope-anyon","relative_path":"_projects/2021-01-06-antelope-anyon.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2021-01-08 10:20:35 +0700","title":"Quiet Lake","subtitle":"Photography","image":"/images/project-7.jpg","slug":"quiet-lake","ext":".md","tags":[],"excerpt":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n","content":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n\n<p><img src=\"/images/image-example-3.jpg\" alt=\"Palm trees\" width=\"1200\" height=\"900\" /></p>\n\n<p>Praeteritis, inquit, gaudeo. Praeteritis, inquit, gaudeo. Quod, inquit, quamquam voluptatibus quibusdam est saepe iucundius, tamen expetitur propter voluptatem. Scientiam pollicentur, quam non erat mirum sapientiae cupido patria esse cariorem. Non quaeritur autem quid naturae tuae consentaneum sit, sed quid disciplinae. Ita ne hoc quidem modo paria peccata sunt. Ita prorsus, inquam; Nunc ita separantur, ut disiuncta sint, quo nihil potest esse perversius. Virtutibus igitur rectissime mihi videris et ad consuetudinem nostrae orationis.</p>\n\n<p><img src=\"/images/image-example-4.jpg\" alt=\"Sea\" width=\"1200\" height=\"900\" /></p>\n\n<p>Defecerit Sed isti ipsi, qui voluptate et dolore omnia metiuntur, nonne clamant sapienti plus semper adesse quod velit quam quod nolit? Quae quidem sapientes sequuntur duce natura tamquam videntes; Quod enim dissolutum sit, id esse sine sensu, quod autem sine sensu. Sunt omnia Longum est enim ad omnia respondere, quae a te dicta sunt. Nam cui proposito sit conservatio sui, necesse est huic partes quoque sui caras suo genere laudabiles servari.</p>\n","url":"/project/quiet-lake","relative_path":"_projects/2021-01-08-quiet-lake.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2021-01-09 11:20:35 +0700","title":"The rocks","subtitle":"Photography","image":"/images/project-6.jpg","slug":"the-rocks","ext":".md","tags":[],"excerpt":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n","content":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n\n<p><img src=\"/images/image-example-3.jpg\" alt=\"Palm trees\" width=\"1200\" height=\"900\" /></p>\n\n<p>Praeteritis, inquit, gaudeo. Praeteritis, inquit, gaudeo. Quod, inquit, quamquam voluptatibus quibusdam est saepe iucundius, tamen expetitur propter voluptatem. Scientiam pollicentur, quam non erat mirum sapientiae cupido patria esse cariorem. Non quaeritur autem quid naturae tuae consentaneum sit, sed quid disciplinae. Ita ne hoc quidem modo paria peccata sunt. Ita prorsus, inquam; Nunc ita separantur, ut disiuncta sint, quo nihil potest esse perversius. Virtutibus igitur rectissime mihi videris et ad consuetudinem nostrae orationis.</p>\n\n<p><img src=\"/images/image-example-4.jpg\" alt=\"Sea\" width=\"1200\" height=\"900\" /></p>\n\n<p>Defecerit Sed isti ipsi, qui voluptate et dolore omnia metiuntur, nonne clamant sapienti plus semper adesse quod velit quam quod nolit? Quae quidem sapientes sequuntur duce natura tamquam videntes; Quod enim dissolutum sit, id esse sine sensu, quod autem sine sensu. Sunt omnia Longum est enim ad omnia respondere, quae a te dicta sunt. Nam cui proposito sit conservatio sui, necesse est huic partes quoque sui caras suo genere laudabiles servari.</p>\n","url":"/project/the-rocks","relative_path":"_projects/2021-01-09-the-rocks.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2021-01-10 11:30:35 +0700","title":"Big airplane","subtitle":"Photography","image":"/images/project-5.jpg","slug":"big-airplane","ext":".md","tags":[],"excerpt":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n","content":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n\n<p><img src=\"/images/image-example-3.jpg\" alt=\"Palm trees\" width=\"1200\" height=\"900\" /></p>\n\n<p>Praeteritis, inquit, gaudeo. Praeteritis, inquit, gaudeo. Quod, inquit, quamquam voluptatibus quibusdam est saepe iucundius, tamen expetitur propter voluptatem. Scientiam pollicentur, quam non erat mirum sapientiae cupido patria esse cariorem. Non quaeritur autem quid naturae tuae consentaneum sit, sed quid disciplinae. Ita ne hoc quidem modo paria peccata sunt. Ita prorsus, inquam; Nunc ita separantur, ut disiuncta sint, quo nihil potest esse perversius. Virtutibus igitur rectissime mihi videris et ad consuetudinem nostrae orationis.</p>\n\n<p><img src=\"/images/image-example-4.jpg\" alt=\"Sea\" width=\"1200\" height=\"900\" /></p>\n\n<p>Defecerit Sed isti ipsi, qui voluptate et dolore omnia metiuntur, nonne clamant sapienti plus semper adesse quod velit quam quod nolit? Quae quidem sapientes sequuntur duce natura tamquam videntes; Quod enim dissolutum sit, id esse sine sensu, quod autem sine sensu. Sunt omnia Longum est enim ad omnia respondere, quae a te dicta sunt. Nam cui proposito sit conservatio sui, necesse est huic partes quoque sui caras suo genere laudabiles servari.</p>\n","url":"/project/big-airplane","relative_path":"_projects/2021-01-10-big-airplane.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2021-01-11 11:40:35 +0700","title":"Mountains","subtitle":"Photography","image":"/images/project-4.jpg","slug":"mountains","ext":".md","tags":[],"excerpt":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n","content":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n\n<p><img src=\"/images/image-example-3.jpg\" alt=\"Palm trees\" width=\"1200\" height=\"900\" /></p>\n\n<p>Praeteritis, inquit, gaudeo. Praeteritis, inquit, gaudeo. Quod, inquit, quamquam voluptatibus quibusdam est saepe iucundius, tamen expetitur propter voluptatem. Scientiam pollicentur, quam non erat mirum sapientiae cupido patria esse cariorem. Non quaeritur autem quid naturae tuae consentaneum sit, sed quid disciplinae. Ita ne hoc quidem modo paria peccata sunt. Ita prorsus, inquam; Nunc ita separantur, ut disiuncta sint, quo nihil potest esse perversius. Virtutibus igitur rectissime mihi videris et ad consuetudinem nostrae orationis.</p>\n\n<p><img src=\"/images/image-example-4.jpg\" alt=\"Sea\" width=\"1200\" height=\"900\" /></p>\n\n<p>Defecerit Sed isti ipsi, qui voluptate et dolore omnia metiuntur, nonne clamant sapienti plus semper adesse quod velit quam quod nolit? Quae quidem sapientes sequuntur duce natura tamquam videntes; Quod enim dissolutum sit, id esse sine sensu, quod autem sine sensu. Sunt omnia Longum est enim ad omnia respondere, quae a te dicta sunt. Nam cui proposito sit conservatio sui, necesse est huic partes quoque sui caras suo genere laudabiles servari.</p>\n","url":"/project/mountains","relative_path":"_projects/2021-01-11-mountains.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2021-01-12 11:50:35 +0700","title":"Sea and rest","subtitle":"Photography","image":"/images/project-3.jpg","slug":"sea-and-rest","ext":".md","tags":[],"excerpt":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n","content":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n\n<p><img src=\"/images/image-example-3.jpg\" alt=\"Palm trees\" width=\"1200\" height=\"900\" /></p>\n\n<p>Praeteritis, inquit, gaudeo. Praeteritis, inquit, gaudeo. Quod, inquit, quamquam voluptatibus quibusdam est saepe iucundius, tamen expetitur propter voluptatem. Scientiam pollicentur, quam non erat mirum sapientiae cupido patria esse cariorem. Non quaeritur autem quid naturae tuae consentaneum sit, sed quid disciplinae. Ita ne hoc quidem modo paria peccata sunt. Ita prorsus, inquam; Nunc ita separantur, ut disiuncta sint, quo nihil potest esse perversius. Virtutibus igitur rectissime mihi videris et ad consuetudinem nostrae orationis.</p>\n\n<p><img src=\"/images/image-example-4.jpg\" alt=\"Sea\" width=\"1200\" height=\"900\" /></p>\n\n<p>Defecerit Sed isti ipsi, qui voluptate et dolore omnia metiuntur, nonne clamant sapienti plus semper adesse quod velit quam quod nolit? Quae quidem sapientes sequuntur duce natura tamquam videntes; Quod enim dissolutum sit, id esse sine sensu, quod autem sine sensu. Sunt omnia Longum est enim ad omnia respondere, quae a te dicta sunt. Nam cui proposito sit conservatio sui, necesse est huic partes quoque sui caras suo genere laudabiles servari.</p>\n","url":"/project/sea-and-rest","relative_path":"_projects/2021-01-12-sea-and-rest.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2021-01-14 12:00:35 +0700","title":"Prague city","subtitle":"Photography","image":"/images/project-2.jpg","slug":"prague-city","ext":".md","tags":[],"excerpt":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n","content":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n\n<p><img src=\"/images/image-example-3.jpg\" alt=\"Palm trees\" width=\"1200\" height=\"900\" /></p>\n\n<p>Praeteritis, inquit, gaudeo. Praeteritis, inquit, gaudeo. Quod, inquit, quamquam voluptatibus quibusdam est saepe iucundius, tamen expetitur propter voluptatem. Scientiam pollicentur, quam non erat mirum sapientiae cupido patria esse cariorem. Non quaeritur autem quid naturae tuae consentaneum sit, sed quid disciplinae. Ita ne hoc quidem modo paria peccata sunt. Ita prorsus, inquam; Nunc ita separantur, ut disiuncta sint, quo nihil potest esse perversius. Virtutibus igitur rectissime mihi videris et ad consuetudinem nostrae orationis.</p>\n\n<p><img src=\"/images/image-example-4.jpg\" alt=\"Sea\" width=\"1200\" height=\"900\" /></p>\n\n<p>Defecerit Sed isti ipsi, qui voluptate et dolore omnia metiuntur, nonne clamant sapienti plus semper adesse quod velit quam quod nolit? Quae quidem sapientes sequuntur duce natura tamquam videntes; Quod enim dissolutum sit, id esse sine sensu, quod autem sine sensu. Sunt omnia Longum est enim ad omnia respondere, quae a te dicta sunt. Nam cui proposito sit conservatio sui, necesse est huic partes quoque sui caras suo genere laudabiles servari.</p>\n","url":"/project/prague-city","relative_path":"_projects/2021-01-14-prague-city.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2021-01-15 12:20:35 +0700","title":"Desk setup","subtitle":"Photography","image":"/images/project-1.jpg","slug":"desk-setup","ext":".md","tags":[],"excerpt":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n","content":"<p>In qua quid est boni praeter summam voluptatem, et eam sempiternam? Cur post Tarentum ad Archytam? Qua ex cognitione facilior facta est investigatio rerum occultissimarum. Negat enim tenuissimo victu, id est contemptissimis escis et potionibus, minorem voluptatem.</p>\n\n<p><img src=\"/images/image-example-3.jpg\" alt=\"Palm trees\" width=\"1200\" height=\"900\" /></p>\n\n<p>Praeteritis, inquit, gaudeo. Praeteritis, inquit, gaudeo. Quod, inquit, quamquam voluptatibus quibusdam est saepe iucundius, tamen expetitur propter voluptatem. Scientiam pollicentur, quam non erat mirum sapientiae cupido patria esse cariorem. Non quaeritur autem quid naturae tuae consentaneum sit, sed quid disciplinae. Ita ne hoc quidem modo paria peccata sunt. Ita prorsus, inquam; Nunc ita separantur, ut disiuncta sint, quo nihil potest esse perversius. Virtutibus igitur rectissime mihi videris et ad consuetudinem nostrae orationis.</p>\n\n<p><img src=\"/images/image-example-4.jpg\" alt=\"Sea\" width=\"1200\" height=\"900\" /></p>\n\n<p>Defecerit Sed isti ipsi, qui voluptate et dolore omnia metiuntur, nonne clamant sapienti plus semper adesse quod velit quam quod nolit? Quae quidem sapientes sequuntur duce natura tamquam videntes; Quod enim dissolutum sit, id esse sine sensu, quod autem sine sensu. Sunt omnia Longum est enim ad omnia respondere, quae a te dicta sunt. Nam cui proposito sit conservatio sui, necesse est huic partes quoque sui caras suo genere laudabiles servari.</p>\n","url":"/project/desk-setup","relative_path":"_projects/2021-01-15-desk-setup.md","permalink":null}],"testimonials":[{"draft":false,"categories":[],"layout":"default","name":"Justin Baptista","position":"Copywriter","image":"images/client-1.jpg","blurb":"Quamquam id quidem, infinitum est in hac urbe, Ita multo sanguine profuso in laetitia et in victoria est mortuus. Atqui pugnantibus et contrariis studiis semper.","title":"Justin","slug":"justin","ext":".md","tags":[],"excerpt":"\n","date":"2022-12-16 11:13:29 +0700","content":"\n","url":"/testimonials/justin.html","relative_path":"_testimonials/justin.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Kadin Herwitz","position":"Traveler","image":"images/client-2.jpg","blurb":"Quamquam id quidem, infinitum est in hac urbe, Ita multo sanguine profuso in laetitia et in victoria est mortuus. Atqui pugnantibus et contrariis studiis semper.","title":"Kadin","slug":"kadin","ext":".md","tags":[],"excerpt":"\n","date":"2022-12-16 11:13:29 +0700","content":"\n","url":"/testimonials/kadin.html","relative_path":"_testimonials/kadin.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Paul Wade","position":"Marketing","image":"images/client-4.jpg","blurb":"Quamquam id quidem, infinitum est in hac urbe, Ita multo sanguine profuso in laetitia et in victoria est mortuus. Atqui pugnantibus et contrariis studiis semper.","title":"Paul","slug":"paul","ext":".md","tags":[],"excerpt":"\n","date":"2022-12-16 11:13:29 +0700","content":"\n","url":"/testimonials/paul.html","relative_path":"_testimonials/paul.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Tatiana Curtis","position":"Art Director","image":"images/client-3.jpg","blurb":"Quamquam id quidem, infinitum est in hac urbe, Ita multo sanguine profuso in laetitia et in victoria est mortuus. Atqui pugnantibus et contrariis studiis semper.","title":"Tatiana","slug":"tatiana","ext":".md","tags":[],"excerpt":"\n","date":"2022-12-16 11:13:29 +0700","content":"\n","url":"/testimonials/tatiana.html","relative_path":"_testimonials/tatiana.md","permalink":null}],"data":{"general_settings":{"title":"Scott Harvey","description":"Personal blog of Scott Harvey, Ruby on Rails developer","social_media_share_image":"/images/scott.png","disqus-identifier":null,"google-analytics":null},"author":{"author_name":"Scott Harvey","author_image":"/images/scott.png"},"social_links":{"social":[{"icon":"Twitter","link":"https://twitter.com/scottharveyco"},{"icon":"Github","link":"https://github.com/scottharvey"}]},"navigation":{"logo_image":"/images/avatar.png","menu__settings":{"menu__items":[{"title":"Home","url":"/"},{"title":"Blog","url":"/blog/"},{"title":"About","url":"/about/"}]}},"footer":{"footer_menu__settings":{"menu__items":[{"title":"Home","url":"/"},{"title":"Blog","url":"/blog/"},{"title":"About","url":"/about/"}]},"copyright_text_html":"<p> 2022 &copy; Scott Harvey. Template by <a href=\"https://cloudcannon.com/\">CloudCannon</a>.</p>"},"newsletter":{"newsletter_title":"Join my mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"frnla.us6.list-manage.com/subscribe/post?u=6314d69a3f315af7ce3fb00a0&amp;id=3038727cc3","newsletter_button":"Subscribe"}},"baseurl":null,"title":"Vonge"}}